app/views/groups/index.html.haml

SELECT "students".* FROM "students" INNER JOIN "group_students" ON "students"."id" = "group_students"."student_id" WHERE "group_students"."group_id" = $1  [["group_id", 1]]
---
        %td= group.semester
        %td= raw(group.students.map{ |g| link_to(g.full_name, student_path(g)) }.join(', '))