app/controllers/groups_controller.rb

INSERT INTO "groups" ("title", "course", "semester", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "121131"], ["course", 4], ["semester", 8], ["created_at", "2016-02-28 20:28:20.954713"], ["updated_at", "2016-02-28 20:28:20.954713"]]
---
  def create
    @group = Group.new(group_params)
    if params.has_key?(:group) and params[:group].has_key?(:plans)
      @gp = params[:group][:plans].map{ |gp| gp.to_i } - [0]
    end
    if @group.save