app/controllers/messages_controller.rb

INSERT INTO "messages" ("header", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["header", "number 1"], ["text", "number 1"], ["created_at", "2016-02-20 11:06:53.188849"], ["updated_at", "2016-02-20 11:06:53.188849"]]
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save

UPDATE "messages" SET "header" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["header", "1"], ["updated_at", "2016-02-27 22:54:58.522303"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @message.update(message_params)