app/controllers/students_controller.rb

INSERT INTO "students" ("last_name", "first_name", "second_name", "b_date", "passport_id", "passport_series", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @student = Student.new(student_params)
    if params.has_key?(:student) and params[:student].has_key?(:groups)
      @sg = params[:student][:groups].map{ |sg| sg.to_i } - [0]
    end
    if @student.save