app/controllers/teachers_controller.rb

  def create
    @teacher = Teacher.new(teacher_params)
    if params.has_key?(:teacher) and params[:teacher].has_key?(:subjects)
      @ts = params[:teacher][:subjects].map{ |ts| ts.to_i } - [0]
    end
    if @teacher.save
---
INSERT INTO "teachers" ("last_name", "second_name", "first_name", "degree", "rank", "position", "b_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"